# NAME: ANSH PUJARA
# ASSIGNMENT DAY 16 - 17
# AI - ML BATCH 1

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('titles.csv')
cast = pd.read_csv('cast.csv')
release_date = pd.read_csv('release_dates.csv')
data.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [13]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [67]:
cast[(cast.character == 'Lead')]

,title,year,name,type,character,n
126515,Sk8r Grrl,2018,Mimi Balmori,actor,Lead,2.0
129230,NaMo 4D,2015,Victor Banerjee,actor,Lead,NaN
208032,Hog Wild,1980,Matt Birman,actor,Lead,20.0
250561,"Re-Percussions, PAN: Our African Odyssey",2015,Bowei Sonie Bowie,actor,Lead,NaN
253530,Brilliant,2004,Matthew (II) Boylan,actor,Lead,NaN
...,...,...,...,...,...,...
3490634,Te para Tres,2013,Judith Rodriguez Perez,actress,Lead,NaN
3534575,The One and Only,2014,Hannah Scadden,actress,Lead,NaN
3546595,Tides of the Heart,2012,Elizabeth Seaton,actress,Lead,NaN
3584421,Love Chronicles,2003,Caroline Whitney Smith,actress,Lead,19.0
3717939,The Return of Tommy Tricker,1994,Amanda (II) Walsh,actress,Lead,NaN

In [15]:
release_date

                          title  year      country        date
0         #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                         #BKKY  2016     Cambodia  2017-10-12
2                       #Beings  2015      Romania  2015-01-29
3                     #Captured  2017          USA  2017-09-05
4        #Ewankosau saranghaeyo  2015  Philippines  2015-01-21
...                         ...   ...          ...         ...
479483  xXx: State of the Union  2005      Uruguay  2005-04-29
479484  xXx: State of the Union  2005       Poland  2005-06-03
479485  xXx: State of the Union  2005       Turkey  2005-06-03
479486  xXx: State of the Union  2005        China  2005-06-17
479487  xXx: State of the Union  2005       Greece  2005-06-24

[479488 rows x 4 columns]

### How many movies are listed in the titles dataframe?

In [3]:
data['title'].nunique()

223828

### What are the earliest two films listed in the titles dataframe?

In [4]:
two = data.sort_values(by='year')
two.iloc[:2].title

193222            Miss Jerry
51388     The Startled Lover
Name: title, dtype: object

### How many movies have the title "Hamlet"?

In [5]:
data.title.value_counts()['Hamlet']

20

### How many movies are titled "North by Northwest"?

In [6]:
data.title.value_counts()['North by Northwest']

1

### When was the first movie titled "Hamlet" made?

In [7]:
sortdata = data.sort_values(by='year')
sortdata = sortdata[sortdata['title'] == 'Hamlet']
val = sortdata[sortdata.year == sortdata.year.min()]

In [8]:
val.year

52521    1910
Name: year, dtype: int64

### List all of the "Treasure Island" movies from earliest to most recent.

In [9]:
data[data['title'] == 'Treasure Island'].sort_values(by='year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [10]:
filt = data[data['year'] == 1950]
filt['title'].value_counts().sum()

1113

### How many movies were made in the year 1960?

In [11]:
filt = data[data['year'] == 1960]
filt['title'].value_counts().sum()

1549

### How many movies were made from 1950 through 1959?

In [12]:
filt = data[(data['year'] >= 1950) & (data['year'] <= 1959)]
filt['title'].value_counts().sum()

12934

### How many roles were there in the movie "Inception"?

In [19]:
temp = cast[cast.title == 'Inception']
temp['name'].value_counts().sum()

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [23]:
temp = cast[(cast.title == 'Inception') & (cast.n.isna() == True)]
temp['name'].value_counts().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [24]:
temp = cast[(cast.title == 'Inception') & (cast.n.isna() == False)]
temp['name'].value_counts().sum()

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [26]:
temp = cast[(cast['title'] == 'North by Northwest')].sort_values(by = 'n')
temp['name']

871426              Cary Grant
3518333        Eva Marie Saint
1457165            James Mason
3157232    Jessie Royce Landis
356707          Leo G. Carroll
                  ...
3441077        Maudie Prickett
3577128            Doris Singh
3599912           Helen Spring
3739133          Susan Whitney
3751311         Paula Winslowe
Name: name, Length: 116, dtype: object

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [27]:
tmp = cast[(cast.title == 'Sleuth') & (cast.year == 1972)].sort_values(by = 'n')
tmp.name

1705394      Laurence Olivier
326773          Michael Caine
373876         Alec Cawthorne
1465483    John (II) Matthews
2724553    Eve (III) Channing
1448690          Teddy Martin
Name: name, dtype: object

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [28]:
tmp = cast[(cast.title == 'Sleuth') & (cast.year == 2007)].sort_values(by = 'n')
tmp.name

326774           Michael Caine
1293634               Jude Law
1805907          Harold Pinter
260242         Kenneth Branagh
373877     Alec (II) Cawthorne
2724552      Eve (II) Channing
3370424      Carmel O'Sullivan
Name: name, dtype: object

### How many roles were credited in the silent 1921 version of Hamlet?

In [54]:
tmp = cast[(cast.title == 'Hamlet') & (cast.year == 1921)]
tmp.character.value_counts().sum()

9

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [53]:
tmp = cast[(cast.title == 'Hamlet') & (cast.year == 1996)]
tmp.character.value_counts().sum()

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [52]:
tmp = cast[(cast.character == 'Hamlet')]
tmp.character.value_counts().sum()

96

### How many people have played an "Ophelia"?

In [46]:
tmp = cast[(cast.character == 'Ophelia')]
tmp.name.value_counts().sum()

117

### How many people have played a role called "The Dude"?

In [47]:
tmp = cast[(cast.character == 'The Dude')]
tmp.name.value_counts().sum()

19

### How many people have played a role called "The Stranger"?

In [48]:
tmp = cast[(cast.character == 'The Stranger')]
tmp.name.value_counts().sum()

212

### How many roles has Sidney Poitier played throughout his career?

In [49]:
tmp = cast[(cast.name == 'Sidney Poitier')]
tmp.character.value_counts().sum()

43

### How many roles has Judi Dench played?

In [50]:
tmp = cast[(cast.name == 'Judi Dench')]
tmp.character.value_counts().sum()

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [64]:
tmp = cast[(cast.name == 'Cary Grant') & (cast.n == 2) & ((cast.year >= 1940) & (cast.year < 1950) & (cast.character != 'Lead'))].sort_values(by = 'year')
tmp.character

871423     Nick Arden
871433    Roger Adams
Name: character, dtype: object

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [65]:
tmp = cast[(cast.name == 'Cary Grant') & ((cast.year >= 1940) & (cast.year < 1950) & (cast.character == 'Lead'))].sort_values(by = 'year')
tmp.character

Series([], Name: character, dtype: object)

### How many roles were available for actors in the 1950s?

In [68]:
tmp = cast[(cast.type == 'actor') & ((cast.year >= 1950) & (cast.year < 1960))]
tmp.name.value_counts().sum()

157738

### How many roles were available for actresses in the 1950s?

In [69]:
tmp = cast[(cast.type == 'actress') & ((cast.year >= 1950) & (cast.year < 1960))]
tmp.name.value_counts().sum()

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [75]:
tmp = cast[(cast.character == 'Lead') & (cast.year <= 1980)]
tmp.character.value_counts().sum()

1

### How many non-leading roles were available through from the beginning of film history through 1980?

In [76]:
tmp = cast[(cast.character != 'Lead') & (cast.year <= 1980)]
tmp.character.value_counts().sum()

1182806

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [77]:
tmp = cast[(cast.character != 'Lead') & (cast.n.isna() == True) & (cast.year <= 1980)]
tmp.character.value_counts().sum()

448347